{
    "Profile Summary": "Profile\nResults-driven software engineer with expertise in AI, data systems, IoT, and a strong foundation in mathematics and finance, dedicated\nto leveraging cutting-edge technologies for innovative, high-impact solutions in challenging environments.",
    "Education": [
        "Education",
        " International Baccalaureate Diploma Singapore",
        "Overseas Family School Aug 2020 – May 2022",
        "◦ Subjects: HL: Computer Science, ITGS, Business Management, English A; SL: Mathematics: Analysis and Approaches, Spanish Ab Initio",
        "◦ Activities and Societies: Leader of the Java Club and the Rocket Science Club. Participated in the Applied Engineering Club,",
        "Computer Programming Club (Python) and the Computer Linux Club for Beginners",
        "◦ 4 HL Achiever: Sole student to take 4 higher level subjects out of a cohort of 250+ students"
    ],
    "Experience": [
        "Relevant Experience",
        " Stealth San Francisco, California, USA (Remote)",
        "AI Startup Developer Oct 2024 – Present",
        "◦ Startup Mentorship: Working with Jeff Wilson (2x founder, YC alum, Harvard fellow, former professor/dean)",
        "◦ Lead Developer: Responsible for entire codebase of pre-seed AI startup",
        " RevisionDojo Singapore",
        "Software Engineer Aug 2024 – Present",
        "◦ Web Scraper Development: Built a scraper using Node.js, Axios, and Cheerio to extract GMAT and A-Level curriculum data.",
        "◦ AI Integration: Implemented OpenAI’s GPT-3.5 API to generate concise subject descriptions from CSV files automatically.",
        "◦ Data Structuring: Organized scraped data into a structured JSON format for better content management.",
        "◦ Code Optimization: Enhanced code performance and maintainability for scraping and description generation processes.",
        " BlueWave Technologies Singapore",
        "Software Engineering Intern May 2024 – Present",
        "◦ Node-RED and OpenSCAD: Learning Node-RED and OpenSCAD for battery monitoring systems. Focused on innovative solutions for",
        "industrial backup power systems.",
        " CampusAI Singapore",
        "Software Engineering Intern June 2023 – April 2024",
        "◦ Developed automated Jupyter notebooks: CreatedJupyternotebookstoautomateAIlabstailoredforthefinancialservicessector.",
        "◦ Utilized APIs: Enhanced educational tools using OpenAI, Open Router, and AYP APIs.",
        "◦ Professional Development: Engaged in continuous professional development through finance-related courses.",
        "◦ Organized Webinars: Organized webinars to guide students in exploring careers in finance.",
        " GoSmacK Singapore",
        "Financial Analysis Intern June 2022 – July 2022",
        "◦ Investment Support for SMEs: Aided local SMEs affected by COVID-19 in obtaining approximately SGD 30,000 in investment from",
        "angel investors.",
        "◦ Financial Statement Automation: Automated the company’s financial statements, including computations for profit and loss accounts,",
        "profitability ratios, and revenue forecasting.",
        "◦ Pitching to Angel Investors: Assisted the company in pitching its business concept to angel investors to acquire funds for ongoing",
        "operations.",
        "◦ Digital Marketing and Development: Supported the firm in digital marketing, establishing a social media presence, and developing",
        "booking platforms and websites.",
        " Sigma.ai Singapore",
        "Content Manager and Lecturer May 2021 – May 2022",
        "◦ Teaching: Taught machine learning fundamentals, including types of learning, regression, and activation functions."
    ],
    "Skills": [
        "Skills",
        " Computer Skills: Java, SQL, Python, HTML, CSS, R, LaTeX, Node.js, Node-RED",
        " Libraries: NumPy, TensorFlow, Keras, Sci-kit learn, PyTorch, Matplotlib, Prophet, Pandas, Plotly, Qiskit, OpenCV",
        " Tools and Technologies: AWS, Amazon S3, TCP Dump, Cisco Packet Tracer, MATLAB, Squarespace, Microsoft Office",
        " Financial Skills: Bloomberg Terminal, Profitability Ratios, Liquidity Ratios, Financial Analysis, Securities Research",
        " Other Skills: Web Scraping with Python"
    ],
    "Projects": [
        "Academic Projects",
        "• Assembly Virtual Machine Emulator: Initiated development of an Assembly Virtual Machine Emulator using C++ and Assembly, aimed",
        "at demonstrating proficiency in low-level systems programming and computer architecture",
        "• Video-To-Text Processing: DevelopedavideoprocessingsystemusingGoogleColab,gdown,andOpenCVforframeextractionandhandling.",
        "Researched video captioning models including VideoLLM-online, Vid2Seq, mPLUG-video, and VideoBLIP-OPT-2.7b. Analyzed performance",
        "metrics and cost implications of large language models like OPT-2.7B and datasets like Ego4D.",
        "• Image-To-Text Processing: Developed a Jupyter Notebook for generating captions from image inputs. Researched and identified the best",
        "large language models (LLMs) tailored for image-to-caption tasks. Implemented and tested models to optimize caption accuracy and relevance.",
        "Utilized packages such as numpy, opencv-python, scikit-learn, pandas, and matplotlib to support data processing and visualization tasks.",
        "• Extended Essay: Analyzed Apple’s 2018 acquisition of Shazam Inc., focusing on its impact on the music streaming industry. Utilized business",
        "management and financial tools, including SWOT, profitability ratios, market share analysis, STEEPLE, and Ansoff Matrix.Employed Google",
        "Finance on Google Sheets to generate financial figures from NASDAQ for Apple and Shazam.",
        "• Financial and Mathematics Calculator - Java & JavaFX: Designed a GUI using JavaFX for a versatile calculator and implemented",
        "arithmetic, financial, and statistical calculations.",
        "1"
    ]
}